### mysql과 python 연동
1. 라이브러리 설치
2. sql 서버의 정보를 등록
3. sql 서버에 접속
4. sql 쿼리문을 이용하여 데이터를 CRUD 작업

In [54]:
# pymysql 설치
!pip install pymysql

Requirement already satisfied: pymysql in /Users/eunjin/opt/anaconda3/lib/python3.8/site-packages (1.0.3)

In [55]:
import pymysql

In [56]:
# sql 서버의 정보를 입력
_db = pymysql.connect(
    user = 'root',
    host = '127.0.0.1',
    db = 'ubion_test',
    port = 3306
)

In [57]:
_db2 = pymysql.connect(
    user = 'root', 
    host = '127.0.0.1', 
    db = 'ubion7', 
    port = 3306
)

In [58]:
# cursor 변수 생성
# sql 쿼리문을 실행시키기 위한 필수 변수
# Dictcursor는 sql 쿼리문이 실행되고 나온 데이터를 딕셔너리 형태로 받는다.
cursor = _db.cursor(pymysql.cursors.DictCursor)

In [59]:
sql = """
    select
    *
    from
    user_info
"""
cursor.execute(sql)

7

In [60]:
result = cursor.fetchall()

In [61]:
import pandas as pd

In [62]:
pd.DataFrame(result)

  user_id user_pass user_name   user_phone  user_gender
0    test      1234      test  01012345678            1
1   test3      1234     test5  01011118888            1
2   test4      1234     test5  01011118888            1
3   test5      1234     test5  01012341234            1
4   test6      1234     test6  01011112222            2
5   test8      1234     test8  01011112233            2
6   test9     12234    test10  01077777777            1

In [63]:
sql = """
    select
    * 
    from
    example
"""

cursor.execute(sql)
result = cursor.fetchall()
df = pd.DataFrame(result)
df

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [65]:
sql = """
    insert into
    user_info
    values
    ("test2", "1234", "test5", "01011118888", 1)
"""

cursor.execute(sql)

1

In [66]:
_db.commit()

### sql 함수화
1. 첫 번째 함수
    - 매개변수 1개 (sql 쿼리문)
    - sql 쿼리문을 실행하고 결과를 데이터프레임으로 변경하여 리턴
2. 두 번째 함수
    - 매개변수 1개(sql 쿼리문)
    - sql 쿼리문을 실행하고 데이터베이스를 변경
3. 세 번째 함수
    - 1번 함수와 2번 함수를 하나의 함수에서 실행이 될 수 있도록 생성

In [ ]:
def sql_select(sql):
    # 쿼리문 실행
    cursor.execute(sql)
    # 쿼리문에 대한 결과
    result = cursor.fetchall()
    df = pd.DataFrame(result)
    return df

In [ ]:
sql = """
    select
    *
    from
    user_info
"""
sql_select(sql)

  user_id user_pass user_name   user_phone  user_gender
0    test      1234      test  01012345678            1
1  test10     12234    test10  01077777777            1
2   test3      1234     test5  01011118888            1
3   test4      1234     test5  01011118888            1
4   test5      1234     test5  01012341234            1
5   test6      1234     test6  01011112222            2
6   test8      1234     test8  01011112233            2

In [ ]:
def _sql(sql, values):
    cursor.execute(sql, values)
    _db.commit()

In [ ]:
sql = """
    insert into 
    user_info 
    values 
    (%s, %s, %s, %s, %s)
"""

values = ["test9", "12234", "test10", "01077777777", 1]

_sql(sql, values)

In [ ]:
sql = """
    select
    *
    from
    user_select
"""
sql.find('select')
sql.replace('\n', '').strip().startswith('select')

True

In [ ]:
def sql_query(sql, values = []):
    # if (sql.find("select") != -1) and (sql.find('select') < 10):
    if (sql.replace('\n', '').strip().startswith('select')):
        cursor.execute(sql, values)
        result = cursor.fetchall()
        result = pd.DataFrame(result)
    else:
        cursor.execute(sql, values)
        _db.commit()
        result = "Query OK"
    return result

In [ ]:
sql = """
    select 
    * 
    from
    user_info
"""

sql_query(sql)

  user_id user_pass user_name   user_phone  user_gender
0    test      1234      test  01012345678            1
1  test10     12234    test10  01077777777            1
2   test3      1234     test5  01011118888            1
3   test4      1234     test5  01011118888            1
4   test5      1234     test5  01012341234            1
5   test6      1234     test6  01011112222            2
6   test8      1234     test8  01011112233            2
7   test9     12234    test10  01077777777            1

In [ ]:
sql = """
    delete 
    from 
    user_info 
    where 
    user_id = %s
"""

values = ['test10']

sql_query(sql, values)

'Query OK'

In [ ]:
import mod_sql
import imp 
imp.reload(mod_sql)

In [ ]:
test = mod_sql.Database(
    _host= '127.0.0.1', 
    _user= 'root',  
    _db = 'ubion_test', 
    _port = 3306)

In [ ]:
sql = """
    select 
    * 
    from 
    user_info
"""
test.sql_query(sql)

  user_id user_pass user_name   user_phone  user_gender
0    test      1234      test  01012345678            1
1   test3      1234     test5  01011118888            1
2   test4      1234     test5  01011118888            1
3   test5      1234     test5  01012341234            1
4   test6      1234     test6  01011112222            2
5   test8      1234     test8  01011112233            2
6   test9     12234    test10  01077777777            1

In [ ]:
test2 = mod_sql.Database(
    '127.0.0.1', 
    'root',
    'ubion7', 
    3306
)

In [ ]:
sql = """
    select 
    `Name` as '이름', 
    `Phone` as '휴대폰번호'
    from 
    example 
    where 
    `Gender` = %s
    limit 3
"""
values = ['female']
test.sql_query(sql, values)

  이름          휴대폰번호
0  B  010-1234-5679
1  D  010-1234-5681
2  F  010-1234-5683

In [ ]:
sql =  """
    select 
    createDt as '등록일시', 
    deathCnt as '사망자', 
    decideCnt as '감염자' 
    from 
    corona
"""
test.sql_query(sql)

In [ ]:
test.sql_close()

In [68]:
df = pd.read_csv("../csv/corona.csv")

In [69]:
df.head()

,Unnamed: 0,createDt,deathCnt,decideCnt,seq,stateDt,stateTime,updateDt,accExamCnt,accDefRate
0,0,2022-06-08 09:09:05.982,24305,18188200,904,20220608,00:00,NaN,NaN,NaN
1,1,2022-06-07 09:09:00.897,24299,18174842,903,20220607,00:00,2022-06-08 09:10:36.846,NaN,NaN
2,2,2022-06-06 09:00:06.734,24279,18168670,902,20220606,00:00,2022-06-08 09:10:50.441,NaN,NaN
3,3,2022-06-05 08:53:19.426,24258,18163648,901,20220605,00:00,2022-06-08 09:11:04.758,NaN,NaN
4,4,2022-06-04 08:56:49.219,24238,18153814,900,20220604,00:00,2022-06-08 09:11:26.303,NaN,NaN

In [70]:
df = df[['createDt', 'deathCnt', 'decideCnt']]
df.head()

                  createDt  deathCnt  decideCnt
0  2022-06-08 09:09:05.982     24305   18188200
1  2022-06-07 09:09:00.897     24299   18174842
2  2022-06-06 09:00:06.734     24279   18168670
3  2022-06-05 08:53:19.426     24258   18163648
4  2022-06-04 08:56:49.219     24238   18153814

In [71]:
df.columns = ['등록일시', '사망자', '감염자']
df.head()

                      등록일시    사망자       감염자
0  2022-06-08 09:09:05.982  24305  18188200
1  2022-06-07 09:09:00.897  24299  18174842
2  2022-06-06 09:00:06.734  24279  18168670
3  2022-06-05 08:53:19.426  24258  18163648
4  2022-06-04 08:56:49.219  24238  18153814

In [ ]:
sql = """
    select 
    `Country` as '국가', 
    `Units Sold` as '판매개수', 
    `Unit Price` as '가격', 
    `Unit Cost` as '원가', 
    (`Units Sold` * `Unit Price`) as '총수익', 
    (`Units Sold` * `Unit Cost`) as '총비용', 
    (`Units Sold` * `Unit Price` - `Units Sold` * `Unit Cost`) as '총이윤'
    from 
    `Sales Records`
"""
test.sql_query(sql)